ubiubiubi/iwasz-sandbox/tm4c123-drama-button-v2/src/main.c
                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor1, sizeof(reportDescriptor1));
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(reportDescriptor2);

                        // If there is more data to send than the host requested then just send the requested amount of data.
                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }

                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor2, sizeof(reportDescriptor2));
                }
            break;
        }

        //
        // This is a request for the HID descriptor (as found in the
        // configuration descriptor following the relevant interface).
        //
        case USB_HID_DTYPE_HID:
        {

                if (psUSBRequest->wIndex == 0) {
                        ui32Size = sizeof(hidKeyboardDescriptor1);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor1, ui32Size);
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(hidKeyboardDescriptor2);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor2, ui32Size);
                }
            break;
        }

        //
        // This was an unknown request so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvHIDInstance is the instance data for this HID device.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure.  Assuming the request is
// understood, it is handled and any required response generated.  If the
// request cannot be handled by this device class, endpoint zero is stalled to
// indicate an error to the host.
//
//*****************************************************************************
static void onRequest(void *userData, tUSBRequest *psUSBRequest)
{
        printf ("onRequest bmRequestType:%x, bRequest:%x, wValue:%x, wIndex:%x, wLength:%x\r\n",
                psUSBRequest->bmRequestType,
                psUSBRequest->bRequest,
                psUSBRequest->wValue,
                psUSBRequest->wIndex,
                psUSBRequest->wLength);

        CallbackDTO *callbackDTO = (CallbackDTO *) userData;
        ASSERT(callbackDTO);

        if (psUSBRequest->bmRequestType & USB_RTYPE_VENDOR &&
            psUSBRequest->bmRequestType & USB_RTYPE_INTERFACE) {
//                printf ("+Waiting for data\r\n");
                // This first parameter is asserted to always be 0. This is a bug in the TI's usblib i think.
                USBDCDRequestDataEP0 (0, callbackDTO->incoming, INCOMING_SETUP_DATA_SIZE);
                USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
                return;
        }

        switch (psUSBRequest->bRequest) {
        /*
         * A Get Report request is used by the host to poll a device for its
         * current state. The only required request.
         */
        case USBREQ_GET_REPORT: {
                // Need to ACK the data on end point 0 in this case.
                USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

                // ..then send back the requested report.
                if (psUSBRequest->wIndex == 1) {
                        USBDCDSendDataEP0(0, callbackDTO->report1, REPORT1_SIZE);
                }
                if (psUSBRequest->wIndex == 2) {
                        USBDCDSendDataEP0(0, callbackDTO->report2, REPORT2_SIZE);
                }

                break;
        }

        // This request was not recognized so stall.
        default: {
                USBDCDStallEP0(0);
                break;
        }
        }
}

/**
 * Gets called when data from host to the device has arrived after USBDCDRequestDataEP0
 * has been called.
 */
static void onDataReceivedEP0 (void *userData, uint32_t ui32Info)
{

        CallbackDTO *callbackDTO = (CallbackDTO *) userData;
        ASSERT(callbackDTO);

#if 1
        printf ("onDataReceivedEP0 len (%u) [", (unsigned int)ui32Info);

        for (int i = 0; i < INCOMING_SETUP_DATA_SIZE; ++i) {
                printf ("%d, ", callbackDTO->incoming[i]);
        }

        printf ("]\r\n");
#endif

        USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);
}

//*****************************************************************************
//
// Called by the USB stack for any activity involving one of our endpoints
// other than EP0.  This function is a fan out that merely directs the call to
// the correct handler depending upon the endpoint and transaction direction
// signaled in ui32Status.
//
//*****************************************************************************
static void onEndpointsActivity (void *userData, uint32_t ui32Status)
{
        printf ("onEndpointsActivity ui32Status : %x\r\n", (unsigned int)ui32Status);

        CallbackDTO *callbackDTO = (CallbackDTO *) userData;
        ASSERT(callbackDTO);

        if (ui32Status & 1 << USBEPToIndex (USB_EP_1)) {
                uint32_t ui32EPStatus = USBEndpointStatus (USB0_BASE, USB_EP_1);
                USBDevEndpointStatusClear(USB0_BASE, USB_EP_1, ui32EPStatus);
                callbackDTO->iHIDTxState1 = eHIDStateIdle;
        }

        if (ui32Status & 1 << USBEPToIndex (USB_EP_2)) {
                uint32_t ui32EPStatus = USBEndpointStatus (USB0_BASE, USB_EP_2);
                USBDevEndpointStatusClear(USB0_BASE, USB_EP_2, ui32EPStatus);
                callbackDTO->iHIDTxState2 = eHIDStateIdle;
        }
}

/**
 *
 */
static void onConfigChange (void *userData, uint32_t ui32Info)
{
        printf ("onConfigChange\r\n");

        CallbackDTO *callbackDTO = (CallbackDTO *) userData;
        ASSERT (callbackDTO);

