ubiubiubi/iwasz-sandbox/tm4c123-drama-button-v2/src/main.c
        callbackDTO->iHIDTxState1 = eHIDStateIdle;
        callbackDTO->iHIDTxState2 = eHIDStateIdle;
}

//*****************************************************************************
//
// Schedule transmission of the next packet forming part of an input report.
//
// \param psHIDInst points to the HID device instance whose input report is to
// be sent.
//
// This function is called to transmit the next packet of an input report
// passed to the driver via a call to USBDHIDReportWrite.  If any data remains
// to be sent, a USB packet is written to the FIFO and scheduled for
// transmission to the host.  The function ensures that reports are sent as
// a sequence of full packets followed by either a single int16_t packet or a
// packet with no data to indicate the end of the transaction.
//
//*****************************************************************************
static int32_t scheduleReportTransmission (uint8_t *data, uint16_t len, uint32_t endpoint)
{
        int32_t i32Retcode;

        // Put the data in the correct FIFO.
        i32Retcode = USBEndpointDataPut(USB0_BASE, endpoint, data, len);

        if (i32Retcode != -1) {
                // Send out the current data.
                i32Retcode = USBEndpointDataSend(USB0_BASE, endpoint, USB_TRANS_IN);
        }

        //
        // Tell the caller how we got on.
        //
        return (i32Retcode);
}

/**
 *
 */
uint32_t reportWrite (CallbackDTO *callbackDTO, uint8_t *data, uint16_t length, uint32_t endpoint)
{
        ASSERT(callbackDTO);
        printf ("reportWrite dataLen : %d, \r\n", length);

        //
        // Can we send the data provided?
        //
        if ((endpoint == USB_EP_1 && callbackDTO->iHIDTxState1 != eHIDStateIdle) ||
            (endpoint == USB_EP_2 && callbackDTO->iHIDTxState2 != eHIDStateIdle)) {
                // We are in the middle of sending another report.  Return 0 to
                // indicate that we can't send this report until the previous one
                // finishes.
                return (0);
        }

        // Schedule transmission of the first packet of the report.
        if (endpoint == USB_EP_1) {
                callbackDTO->iHIDTxState1 = eHIDStateWaitData;
        }
        else if (endpoint == USB_EP_2) {
                callbackDTO->iHIDTxState2 = eHIDStateWaitData;
        }

        uint32_t i32Retcode = scheduleReportTransmission(data, length, endpoint);

        //
        // Did an error occur while trying to send the data?
        //
        if (i32Retcode != -1) {
                // No - tell the caller we sent all the bytes provided.
                return (length);
        } else {
                // Yes - tell the caller we could not send the data.
                return (0);
        }
}

/*##########################################################################*/

static tDeviceInfo deviceInfo;

void uartStdioConfig (uint32_t ui32PortNum, uint32_t ui32Baud, uint32_t ui32SrcClock)
{
        //
        // Check the arguments.
        //
        ASSERT((ui32PortNum == 0) || (ui32PortNum == 1) || (ui32PortNum == 2));

        //
        // Check to make sure the UART peripheral is present.
        //
        if (!SysCtlPeripheralPresent(SYSCTL_PERIPH_UART0)) {
                return;
        }

        //
        // Enable the UART peripheral for use.
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

        //
        // Configure the UART for 115200, n, 8, 1
        //
        UARTConfigSetExpClk(UART0_BASE, ui32SrcClock, ui32Baud, (UART_CONFIG_PAR_NONE | UART_CONFIG_STOP_ONE |
        UART_CONFIG_WLEN_8));

        //
        // Enable the UART operation.
        //
        UARTEnable(UART0_BASE);
}

void configureUART (void)
{
        //
        // Enable the GPIO Peripheral used by the UART.
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

        //
        // Enable UART0
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

        //
        // Configure GPIO Pins for UART mode.
        //
        GPIOPinConfigure(GPIO_PA0_U0RX);
        GPIOPinConfigure(GPIO_PA1_U0TX);
        GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

        //
        // Use the internal 16MHz oscillator as the UART clock source.
        //
        UARTClockSourceSet(UART0_BASE, UART_CLOCK_PIOSC);

        //
        // Initialize the UART for console I/O.
        //
        uartStdioConfig(0, 115200, 16000000);
}

/**
 *
 */
int main (void)
{
        SysCtlClockSet (SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);

        configureUART ();
        printf ("tm4c123-drama-button starts\r\n");

        // Enable the GPIO port that is used for the on-board LED.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);


        // USB config : Enable the GPIO peripheral used for USB, and configure the USB pins.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOD);
        GPIOPinTypeUSBAnalog(GPIO_PORTD_AHB_BASE, GPIO_PIN_4 | GPIO_PIN_5);

        ButtonsInit();

        /****************************************************************************/

        CallbackDTO callbackDTO;
        callbackDTO.deviceInfo = &deviceInfo;
        callbackDTO.iHIDTxState1 = eHIDStateUnconfigured;
        callbackDTO.iHIDTxState2 = eHIDStateUnconfigured;

        deviceInfo.psCallbacks = &handlers;
        deviceInfo.pui8DeviceDescriptor = deviceDescriptor;
        deviceInfo.ppsConfigDescriptors = configHeaders;
        deviceInfo.ppui8StringDescriptors = stringDescriptors;
        deviceInfo.ui32NumStringDescriptors = NUM_STRING_DESCRIPTORS;
        USBDCDDeviceInfoInit (0, &deviceInfo);
//        InternalUSBTickInit();

        USBStackModeSet(0, eUSBModeForceDevice, 0);
        USBDCDInit (0, &deviceInfo, &callbackDTO);

        uint8_t ui8ButtonsChanged, ui8Buttons;

        while (1) {
                ButtonsPoll(&ui8ButtonsChanged, &ui8Buttons);

                if (ui8ButtonsChanged) {
                        if(ui8Buttons & LEFT_BUTTON)
                        {
                                printf ("pressed\r\n");
                                callbackDTO.report1[0] = 0x00;
                                callbackDTO.report1[1] = 0x00;
                                callbackDTO.report1[2] = 0x04;

                                callbackDTO.report2[0] = 0x10;
                        }
                        else {
                                printf ("released\r\n");
                                for (int i = 0; i < REPORT1_SIZE; ++i) {
                                        callbackDTO.report1[i] = 0x00;
                                }

                                for (int i = 0; i < REPORT2_SIZE; ++i) {
                                        callbackDTO.report2[i] = 0x00;
                                }
                        }

//                        if (callbackDTO.iHIDTxState1 == eHIDStateIdle) {
//                                reportWrite (&callbackDTO, callbackDTO.report1, REPORT1_SIZE, USB_EP_1);
//                        }

                        if (callbackDTO.iHIDTxState2 == eHIDStateIdle) {
                                reportWrite (&callbackDTO, callbackDTO.report2, REPORT2_SIZE, USB_EP_2);
                        }
                }
        }
}

